# ConfigurationReloadInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConfigurationReloadInfo Members
ConfigurationReloadInfo Class Constructors Methods Properties See Also
---
The ConfigurationReloadInfo type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConfigurationReloadInfo | Constructor. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ConfigurationReloadInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetConnectivityValidation | Returns information about the post-reload connectivity validation. |
| GetCustomDataChangedElements | Gets a list of ElementIds of fabrication parts that had custom data updated during the reload. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOutOfDatePartStatus | Access reload information for out of date part. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Disconnects | The number of disconnections caused by the reload. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OutOfDatePartCount | The number of fabrication part instances that had newer versions and were out of date. |
| ProfileNotAvailable | The current profile is not available in the disk configuration. |

# See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace